In [1]:
import pandas as pd
import numpy as np

In [2]:
# TASK 1: Creating the 3 DataFrames

import pandas as pd
import numpy as np


# 1) Employee DataFrame

employee_data = {
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Name": ["John Alter", "Alice Luxumberg", "Tom Sabestine", "Nina Adgra", "Amy Johny"],
    "Gender": ["M", "F", "M", "F", "F"],
    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid"],
    "Age": [25, 27, 29, 31, 30]
}

df_employee = pd.DataFrame(employee_data)


# 2) Seniority Level DataFrame

seniority_data = {
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Designation Level": [2, 2, 3, 2, 3]
}

df_seniority = pd.DataFrame(seniority_data)


# 3) Project DataFrame

project_data = {
    "ID": ["A001","A002","A003","A004","A005","A002","A005","A003","A001","A003","A001","A004","A004","A005"],
    "Project": ["Project 1","Project 2","Project 3","Project 4","Project 5","Project 6","Project 7","Project 8",
                "Project 9","Project 10","Project 11","Project 12","Project 13","Project 14"],
    "Cost": [1002000, 2000000, 4500000, 5500000, np.nan, 680000, 400000, 350000, np.nan, 300000, 2000000, 1000000, 3000000, 200000],
    "Status": ["Finished", "Ongoing", "Finished", "Ongoing", "Finished", "Failed", "Finished", "Failed",
               "Ongoing", "Finished", "Failed", "Ongoing", "Finished", "Finished"]
}



df_project = pd.DataFrame(project_data)



# Saving all 3 DataFrames as CSV

df_employee.to_csv("Employee.csv", index=False)
df_seniority.to_csv("Seniority.csv", index=False)
df_project.to_csv("Project.csv", index=False)

# Print 
df_employee, df_seniority, df_project

(     ID             Name Gender     City  Age
 0  A001       John Alter      M    Paris   25
 1  A002  Alice Luxumberg      F   London   27
 2  A003    Tom Sabestine      M   Berlin   29
 3  A004       Nina Adgra      F  Newyork   31
 4  A005        Amy Johny      F   Madrid   30,
      ID  Designation Level
 0  A001                  2
 1  A002                  2
 2  A003                  3
 3  A004                  2
 4  A005                  3,
       ID     Project       Cost    Status
 0   A001   Project 1  1002000.0  Finished
 1   A002   Project 2  2000000.0   Ongoing
 2   A003   Project 3  4500000.0  Finished
 3   A004   Project 4  5500000.0   Ongoing
 4   A005   Project 5        NaN  Finished
 5   A002   Project 6   680000.0    Failed
 6   A005   Project 7   400000.0  Finished
 7   A003   Project 8   350000.0    Failed
 8   A001   Project 9        NaN   Ongoing
 9   A003  Project 10   300000.0  Finished
 10  A001  Project 11  2000000.0    Failed
 11  A004  Project 12  1000000.0   Ongoing
 12  A004  Project 13  3000000.0  Finished
 13  A005  Project 14   200000.0  Finished)

In [3]:
# TASK 2: Replace Missing Cost Values

import pandas as pd
import numpy as np

# Loading Project CSV
df_project = pd.read_csv("Project.csv")

# create a List to store previous valid costs
previous_costs = []

# Looping through each row
for i in range(len(df_project)):
    cost = df_project.loc[i, "Cost"]
    
    # If cost is not null â†’ add to previous_costs list
    if not pd.isna(cost):
        previous_costs.append(cost)
    else:
        # running average of previous costs
        running_avg = sum(previous_costs) / len(previous_costs)
        
        # Replace missing value with running average
        df_project.loc[i, "Cost"] = running_avg
        
        # Also adding this new value to previous costs for future averaging
        previous_costs.append(running_avg)

# Saving updated CSV
df_project.to_csv("Project.csv", index=False)

df_project

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [4]:
# TASK 3: Split Name into First Name and Last Name

import pandas as pd

# Loading Employee CSV
df_employee = pd.read_csv("Employee.csv")

# Split the Name column into First Name and Last Name
df_employee[['First Name', 'Last Name']] = df_employee['Name'].str.split(n=1, expand=True)

# Drop the old Name column
df_employee = df_employee.drop(columns=['Name'])

# Saving the updated Employee.csv
df_employee.to_csv("Employee.csv", index=False)

df_employee

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [5]:
# TASK 4: Join all three DataFrames

import pandas as pd

# Loading all CSVs
df_employee = pd.read_csv("Employee.csv")
df_seniority = pd.read_csv("Seniority.csv")
df_project   = pd.read_csv("Project.csv")

# First join Employee + Seniority on "ID"
merged1 = pd.merge(df_employee, df_seniority, on="ID", how="left")

# Next join with Project DataFrame
Final = pd.merge(merged1, df_project, on="ID", how="left")

# final merged dataframe
Final

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,M,Paris,25,John,Alter,2,Project 1,1002000.0,Finished
1,A001,M,Paris,25,John,Alter,2,Project 9,2210312.5,Ongoing
2,A001,M,Paris,25,John,Alter,2,Project 11,2000000.0,Failed
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2000000.0,Ongoing
4,A002,F,London,27,Alice,Luxumberg,2,Project 6,680000.0,Failed
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4500000.0,Finished
6,A003,M,Berlin,29,Tom,Sabestine,3,Project 8,350000.0,Failed
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,300000.0,Finished
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5500000.0,Ongoing
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1000000.0,Ongoing
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3000000.0,Finished
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3250500.0,Finished
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,400000.0,Finished
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,200000.0,Finished

In [6]:
# TASK 5: Add Bonus Column

import numpy as np
import pandas as pd

# Reload the Final dataframe

df_employee = pd.read_csv("Employee.csv")
df_seniority = pd.read_csv("Seniority.csv")
df_project = pd.read_csv("Project.csv")

# Merge again to get Final

merged1 = pd.merge(df_employee, df_seniority, on="ID", how="left")
Final = pd.merge(merged1, df_project, on="ID", how="left")

# Adding the new Bonus column- 5% of Cost only if the project is finished

Final["Bonus"] = np.where(Final["Status"] == "Finished", Final["Cost"] * 0.05, 0)

Final

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,M,Paris,25,John,Alter,2,Project 1,1002000.0,Finished,50100.0
1,A001,M,Paris,25,John,Alter,2,Project 9,2210312.5,Ongoing,0.0
2,A001,M,Paris,25,John,Alter,2,Project 11,2000000.0,Failed,0.0
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2000000.0,Ongoing,0.0
4,A002,F,London,27,Alice,Luxumberg,2,Project 6,680000.0,Failed,0.0
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4500000.0,Finished,225000.0
6,A003,M,Berlin,29,Tom,Sabestine,3,Project 8,350000.0,Failed,0.0
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,300000.0,Finished,15000.0
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5500000.0,Ongoing,0.0
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1000000.0,Ongoing,0.0
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3000000.0,Finished,150000.0
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3250500.0,Finished,162525.0
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,400000.0,Finished,20000.0
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,200000.0,Finished,10000.0

In [7]:
# TASK 6: Demote Level for Failed Projects and Remove Level > 4

import pandas as pd
import numpy as np

# Reload and recreate the Final dataframe 

df_employee = pd.read_csv("Employee.csv")

df_seniority = pd.read_csv("Seniority.csv")

df_project = pd.read_csv("Project.csv")



merged1 = pd.merge(df_employee, df_seniority, on="ID", how="left")

Final = pd.merge(merged1, df_project, on="ID", how="left")

# 1. Demote designation level by 1 if Status = Failed

Final["Designation Level"] = np.where(
    Final["Status"] == "Failed",
    Final["Designation Level"] + 1,
    Final["Designation Level"]
)

# 2. Remove all records where the designation level > 4

Final = Final[Final["Designation Level"] <= 4]

Final

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,M,Paris,25,John,Alter,2,Project 1,1002000.0,Finished
1,A001,M,Paris,25,John,Alter,2,Project 9,2210312.5,Ongoing
2,A001,M,Paris,25,John,Alter,1,Project 11,2000000.0,Failed
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2000000.0,Ongoing
4,A002,F,London,27,Alice,Luxumberg,1,Project 6,680000.0,Failed
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4500000.0,Finished
6,A003,M,Berlin,29,Tom,Sabestine,2,Project 8,350000.0,Failed
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,300000.0,Finished
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5500000.0,Ongoing
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1000000.0,Ongoing
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3000000.0,Finished
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3250500.0,Finished
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,400000.0,Finished
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,200000.0,Finished

In [8]:

# TASK 7: Add Mr./Mrs. to First Name & Drop Gender Column

import pandas as pd
import numpy as np

# Reload data 

df_employee = pd.read_csv("Employee.csv")

df_seniority = pd.read_csv("Seniority.csv")

df_project = pd.read_csv("Project.csv")


merged1 = pd.merge(df_employee, df_seniority, on="ID", how="left")

Final = pd.merge(merged1, df_project, on="ID", how="left")


Final["Designation Level"] = np.where(
    Final["Status"] == "Failed",
    Final["Designation Level"] - 1,
    Final["Designation Level"]
)
Final = Final[Final["Designation Level"] <= 4]



# Add Mr./Mrs. based on gender

Final["First Name"] = np.where(
    Final["Gender"] == "M",
    "Mr. " + Final["First Name"],
    "Mrs. " + Final["First Name"]
)

# Dropping the Gender column
Final = Final.drop(columns=["Gender"])

Final

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1002000.0,Finished
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2210312.5,Ongoing
2,A001,Paris,25,Mr. John,Alter,1,Project 11,2000000.0,Failed
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2000000.0,Ongoing
4,A002,London,27,Mrs. Alice,Luxumberg,1,Project 6,680000.0,Failed
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4500000.0,Finished
6,A003,Berlin,29,Mr. Tom,Sabestine,2,Project 8,350000.0,Failed
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,300000.0,Finished
8,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 4,5500000.0,Ongoing
9,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 12,1000000.0,Ongoing
10,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 13,3000000.0,Finished
11,A005,Madrid,30,Mrs. Amy,Johny,3,Project 5,3250500.0,Finished
12,A005,Madrid,30,Mrs. Amy,Johny,3,Project 7,400000.0,Finished
13,A005,Madrid,30,Mrs. Amy,Johny,3,Project 14,200000.0,Finished

In [9]:
# TASK 8: Promote Designation Level Based on Age

# update the 'Designation Level' column.

Final['Designation Level'] = np.where(
    # Condition: Age > 29 AND Designation Level > 1 
    (Final['Age'] > 29) & (Final['Designation Level'] > 1),
    Final['Designation Level'] - 1, # if True (Promote: Designation number decreases)
    Final['Designation Level']     # if False (Keep the current level)
)

Final

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1002000.0,Finished
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2210312.5,Ongoing
2,A001,Paris,25,Mr. John,Alter,1,Project 11,2000000.0,Failed
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2000000.0,Ongoing
4,A002,London,27,Mrs. Alice,Luxumberg,1,Project 6,680000.0,Failed
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4500000.0,Finished
6,A003,Berlin,29,Mr. Tom,Sabestine,2,Project 8,350000.0,Failed
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,300000.0,Finished
8,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 4,5500000.0,Ongoing
9,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 12,1000000.0,Ongoing
10,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 13,3000000.0,Finished
11,A005,Madrid,30,Mrs. Amy,Johny,2,Project 5,3250500.0,Finished
12,A005,Madrid,30,Mrs. Amy,Johny,2,Project 7,400000.0,Finished
13,A005,Madrid,30,Mrs. Amy,Johny,2,Project 14,200000.0,Finished

In [10]:
# TASK 9: Calculate Total Project Cost per Employee

# Group the 'Final' DataFrame by the unique employee identifiers -> Calculate the sum of the Cost column ->convert the resulting Series back into a DataFrame

TotalProjCost = Final.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

# Rename the summed 'Cost' column to 'Total Cost' 

TotalProjCost = TotalProjCost.rename(columns={'Cost': 'Total Cost'})

print("TotalProjCost DataFrame:")
TotalProjCost

TotalProjCost DataFrame:

     ID  First Name  Total Cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

In [11]:
# TASK 10: Filter Employee Details by City Name

# Filter the 'Final' DataFrame.
# to find city names containing 'o' or 'O' and to ensure rows with missing City values are skipped safely.

employees_with_o_in_city = Final[Final['City'].str.contains('o', case=False, na=False)].copy()


# drop duplicate employee records

employee_details_to_print = employees_with_o_in_city[['ID', 'First Name', 'City', 'Age', 'Designation Level']].drop_duplicates()

print("Employee Details for cities containing the letter 'o':")
employee_details_to_print

Employee Details for cities containing the letter 'o':

     ID  First Name     City  Age  Designation Level
3  A002  Mrs. Alice   London   27                  2
4  A002  Mrs. Alice   London   27                  1
8  A004   Mrs. Nina  Newyork   31                  1